app/Controllers/Login_Admin.php

    public function login_action()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = new User();
        $data = $user->asObject()->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'aridianaabdul@gmail.com'
 LIMIT 1