app/Controllers/Profile.php

INSERT INTO `profile` (`prodi`, `visi`, `misi`, `tujuan`, `created_at`, `updated_at`) VALUES ('Sistem Informasi', 'Pada tahun 2035, Program Studi Sistem Informasi UAA menjadi program studi yang unggul, mandiri di bidang Enterprise Digital mampu bersaing di pasar kerja ASEAN, berkontribusi terhadap pembangunan kesejahteraan bangsa dan peradaban dunia berlandaskan nilai-nilai keislaman dan kebangsaan Indonesia.', 'Menyelenggarakan Tri Dharma Perguruan Tinggi pendidikan sarjana Sistem Informasi yang unggul, mandiri di bidang Enterpise Digital, mampu bersaing di pasar kerja ASEAN, berlandaskan nilai-nilai keislaman dan kebangsaan Indonesia, serta berkontribusi terhadap pembangunan kesejahteraan bangsa dan peradaban dunia.', ' Kuliah di Prodi Sistem Informasi Universitas Alma Ata Raih gelar pendidikan tinggi Anda di Prodi Sistem Informasi Universitas Alma Ata. Anda akan menemukan pengalaman belajar mengesankan memadukan ilmu pengetahuan dengan nilai-nilai keislaman berbasis pesantren, serta didukung dengan suasana akademik kondusif untuk mengembangkan bakat Anda.', '2023-07-07 16:19:44', '2023-07-07 16:19:44')
---
    public function create()
    {
        $dataProfile = $this->request->getPost();
        $this->model->insert($dataProfile);