app/Models/HakAkses.php

SELECT *
FROM `tb_hak_akses`
JOIN `tb_pengguna` ON `tb_hak_akses`.`pengguna_id` =`tb_pengguna`.`id_pengguna`
JOIN `tb_akses` ON `tb_hak_akses`.`akses_id` =`tb_akses`.`id_akses`
---
    public function joinTabel()
    {
        $tabel2 = 'tb_pengguna';
        $tabel3 = 'tb_akses';

        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->join($tabel2, 'tb_hak_akses.pengguna_id =tb_pengguna.id_pengguna');
        $builder->join($tabel3, 'tb_hak_akses.akses_id =tb_akses.id_akses');
        $results = $builder->get()->getResult();