app/Models/PpeppUserModel.php

    public function getAll()
    {
        $builder = $this->db->table('tb_ppepp_user');
        $builder->join('tb_ppepp', 'tb_ppepp.id = tb_ppepp_user.ppepp_id');
        $query = $builder->get();
---
SELECT *
FROM `tb_ppepp_user`
JOIN `tb_ppepp` ON `tb_ppepp`.`id_ppepp` =`tb_ppepp_user`.`ppepp_id`